src/DataProcessors/РабочееМестоУД_Разукомплектовка/РабочееМестоУД_Разукомплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоУД_Разукомплектовка</name>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйСтенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственноеЗадание</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяКарта</name>
      <type>
        <types>DocumentRef.РемонтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыРемонта/ВидыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРемонта</name>
  <enumValues>
    <name>Общий</name>
  </enumValues>
  <enumValues>
    <name>Собственный</name>
  </enumValues>
  <enumValues>
    <name>Дилерский</name>
  </enumValues>
  <enumValues>
    <name>Канбан</name>
  </enumValues>
  <enumValues>
    <name>БракКанбан</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектовка</name>
  </enumValues>
  <enumValues>
    <name>Сторонний</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РемонтнаяКарта/РемонтнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РемонтнаяКарта</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРемонта</name>
    <type>
      <types>CatalogRef.ПричиныРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоРазукомплектовки</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Неисправности</name>
    <attributes>
      <name>ПозицияНеисправногоМПЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеисправныйМПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияМестаНахожденияБрака</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоНахожденияБрака</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапЖизненногоЦикла</name>
      <type>
        <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБрака</name>
      <type>
        <types>CatalogRef.ВидыБрака</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаменяемыеЭлементы</name>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разукомплектовка</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РабочееМестоУД_Разукомплектовка/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Исполнитель = ПараметрыСеанса.Пользователь;
	Если Не Объект.Исполнитель.Пустая() Тогда
		Для каждого ТЧ Из Объект.Исполнитель.ЛинейкиПроизводства Цикл
		СписокЛинеек.Добавить(ТЧ.Линейка);
		КонецЦикла;
	Иначе
	Сообщить("Вы не внесены в справочник Сотрудников! Работа невозможна!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
    ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
    ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
    Сообщить(ТекстСообщения);
	КонецЕсли;
		Если СписокЛинеек.Количество() > 0 Тогда
		ПолучитьДанныеНаСервере();
			Если Объект.ИнтервалОбновления > 0 Тогда
			ПодключитьОбработчикОжидания("ОбновитьДанные", Объект.ИнтервалОбновления*60);
			КонецЕсли; 
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
Объект.Разукомплектовка.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РемонтнаяКарта.Проведен = ЛОЖЬ
	|	И РемонтнаяКарта.ВидРемонта = &ВидРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	РемонтнаяКарта.Дата";
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ВидРемонта",Перечисления.ВидыРемонта.Разукомплектовка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = Объект.Разукомплектовка.Добавить();
	ТЧ.Линейка = ВыборкаДетальныеЗаписи.Ссылка.Линейка;
	ТЧ.ПроизводственноеЗадание = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование;
	ТЧ.Изделие = ВыборкаДетальныеЗаписи.Ссылка.Изделие;
	ТЧ.БарКод = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование.БарКод;
	ТЧ.РемонтнаяКарта = ВыборкаДетальныеЗаписи.Ссылка;
	ВиртуальнаяТабличнаяЧасть = ТЧ.РемонтнаяКарта.Разукомплектовка.Выгрузить();
	ВиртуальнаяТабличнаяЧасть.Свернуть("МПЗ,ЕдиницаИзмерения","Количество");
	МестоХранения = ТЧ.РемонтнаяКарта.ДокументОснование.Линейка.МестоХраненияКанбанов;
		Для Каждого ТЧ_ВЧ Из ВиртуальнаяТабличнаяЧасть Цикл
		Фильтр   = Новый Структура;
		Фильтр.Вставить("МестоХранения",МестоХранения);
		Фильтр.Вставить("МПЗ", ТЧ_ВЧ.МПЗ);
		Остаток = РегистрыНакопления.МестаХранения.Остатки(ТекущаяДата(),Фильтр,"МПЗ", "Количество");
		БазовоеКоличество = ПолучитьБазовоеКоличество(ТЧ_ВЧ.Количество,ТЧ_ВЧ.ЕдиницаИзмерения);
			Если Остаток.Количество() > 0 Тогда
				Если Остаток[0].Количество < БазовоеКоличество Тогда
				ТЧ.НетВКанбанеЛинейки.Добавить(ТЧ_ВЧ.МПЗ,СокрЛП(ТЧ_ВЧ.МПЗ.Наименование)+" ("+ТЧ_ВЧ.Количество+" "+СокрЛП(ТЧ_ВЧ.ЕдиницаИзмерения.Наименование)+")");
				КонецЕсли; 		
			Иначе	
			ТЧ.НетВКанбанеЛинейки.Добавить(ТЧ_ВЧ.МПЗ,СокрЛП(ТЧ_ВЧ.МПЗ.Наименование)+" ("+ТЧ_ВЧ.Количество+" "+СокрЛП(ТЧ_ВЧ.ЕдиницаИзмерения.Наименование)+")");
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Ответ, Отказ) Экспорт
ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
ПолучитьДанныеНаСервере();
КонецПроцедуры
 
&НаКлиенте
Процедура ИнтервалОбновленияПриИзменении(Элемент)
ОтключитьОбработчикОжидания("ОбновитьДанные");
	Если Объект.ИнтервалОбновления > 0 Тогда
	ПодключитьОбработчикОжидания("ОбновитьДанные", Объект.ИнтервалОбновления*60);
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	Выборка = Объект.Разукомплектовка.НайтиСтроки(Новый Структура("БарКод",Данные));
		Если Выборка.Количество() > 0 Тогда	
		Элементы.Разукомплектовка.ТекущаяСтрока = Выборка[0].ПолучитьИдентификатор();
		П = Новый Структура("Ключ",Элементы.Разукомплектовка.ТекущиеДанные.РемонтнаяКарта);
		Оп = Новый ОписаниеОповещения("ПолучитьДанные",ЭтотОбъект,Истина);	
		ОткрытьФорму("Документ.РемонтнаяКарта.ФормаОбъекта",П,,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоБарКоду(Команда)
БарКод = "";
	Если ВвестиСтроку(БарКод,"Введите бар-код",18) Тогда 
	Выборка = Объект.Разукомплектовка.НайтиСтроки(Новый Структура("БарКод",БарКод));
		Если Выборка.Количество() > 0 Тогда	
		Элементы.Разукомплектовка.ТекущаяСтрока = Выборка[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнителя(РК)
РемонтнаяКарта = РК.ПолучитьОбъект();
РемонтнаяКарта.Автор = Объект.Исполнитель;
РемонтнаяКарта.ДатаНачала = ТекущаяДата();
РемонтнаяКарта.Записать();
КонецПроцедуры

&НаКлиенте
Процедура РазукомплектовкаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ЗаполнитьИсполнителя(Элементы.Разукомплектовка.ТекущиеДанные.РемонтнаяКарта);
П = Новый Структура("Ключ",Элементы.Разукомплектовка.ТекущиеДанные.РемонтнаяКарта);
Оп = Новый ОписаниеОповещения("ПолучитьДанные", ЭтотОбъект,Истина);	
ОткрытьФорму("Документ.РемонтнаяКарта.ФормаОбъекта",П,,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтсутствующие(Команда)
Элемент = Неопределено;
Элементы.Разукомплектовка.ТекущиеДанные.НетВКанбанеЛинейки.ВыбратьЭлемент("Нет в канбане линейки",Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
ПолучитьДанныеНаСервере();
КонецПроцедуры
